<?php
$g_c['api'] = array(
        "plat" => "4399",//平台名，用于区分不同配置类型
		'md5_key' => array(//接口密钥,我方接供
		             '4399'=>'jieYou_ztqz#$@%Web.4399.com',	
		             '91wan'=>'jieYou_ztqz#$@%Web.91wan.com',
		             'yujun'=>'jieYou_ztqz#$@%Web.yujun.com',
					 '360'  =>'b4c3cb14386a5048bd4184cc30bcb60e',
					 'test' =>'b4c3cb14386a5048bd4184cc30bcb60e',
		),
		'url' => array(//不同平台的游戏登录跳转网站
					'360' => 'http://cssgol.wan.360.cn',
		),
		'interface_key'=>array(//平台提供的接口密钥
		             '4399'=>'',
		             '91wan'=>'',
		             'yujun'=>'@@!#$cmwebgame8#$DE',
		),
		'interface_url'=>array(//平台提供的接口地址
		             '4399'=>'',
		             '91wan'=>'',
		             'yujun'=>'http://main.cmwebgame.com/api/loggame.shtml',
		),
		'pay_key' => array(
					'360'=>'jieYou_cssg#$@%cssgol.wan.360.cn',
		),
		'pay' => array(
					'allow_ip' => array(//允许充值的IP
					           '4399'=>array( 
										'113.107.110.223',	//后台名电信IP，用于后台充值
										'112.91.168.223',	//后台网通IP，用于后台充值
										'121.10.143.59',	//平台充值IP1
										'121.14.58.93',		//平台充值IP2
										'127.0.0.1',
										'192.168.7.189',//用于189上
					           ),
					           '91wan'=>array(
					                   '127.0.0.1',
					                   '113.107.110.223',	//后台名电信IP
									   '112.91.168.223',	//后台网通IP
					                   '113.108.232.15',//平台充值IP1
					                   '58.248.182.15',//平台充值IP2
					           ),
					           'yujun'=>array(
					                   '113.107.110.223',	//后台名电信IP
									   '112.91.168.223',	//后台网通IP
					                   '218.32.57.128',//平台充值IP1
					                   '127.0.0.1',
					           ),
					),
					'result' => array ( //充值返回结果
										'exile_parameter' 	=> '1',		// 提交参数不齐全
										'ip_error' 			=> '2',		// IP非法
										'md5_key_error' 	=> '3',		// 验证密钥失败					
										'request_timed_out' => '4',		// 请求超时
										'user_not_exist' 	=> '5',		// 用户不存在
										'order_repeat' 		=> '6',		// 订单重复
										'charge_fail' 		=> '7',		// 充值失败
										'true' 				=> '8',		// 成功
					),
				),
		'pay_allow_ip'=>array(
			'91wan'=>array(
					'113.108.232.15',
					'58.248.182.15',
					'119.147.164.115',
					'58.249.114.195',
					'113.108.232.28',
					'58.248.182.28',
					'113.105.223.241',
					'120.31.53.241',
					'114.80.75.162',
					'112.65.45.242'
			),
			'xunlei'=>array(
				'123.150.185.174',
				'111.161.24.174',
				'123.150.185.175',
				'111.161.24.175',
				'119.145.40.161',
			),
		)
		
);
?>