<?php
/*
 * 遊戲參數的一般配置
 */
$g_global["game_level"] = 100; //遊戲等級

$g_global["language"] = array(
                      'zh_CN'=>'簡體中文',
                      'zh_TW'=>'繁體中文',
);

//後台系統功能 - 全局命令：GlobalServer分類
$g_global["GlobalServer"] = array(
									'Cmd Reload 1 0'=>'重讀任務配置',
									'Cmd Reload 2 0'=>'重讀武將配置',
									'Cmd Reload 3 0'=>'重讀物品配置',
									'Cmd Reload 4 0'=>'重讀怪物配置',
									'Cmd Reload 5 0'=>'重讀BOSS配置',
									'Cmd ReloadG 1'=>'重讀雲遊BOSS配置',
);


//所有排行類型：0 等級，1財富，2成就，3修為
$g_global["all_rank_type"] = array(
										0  => array(
											'title'=>'等級榜',
											'value'=>'等級',
										),										
										3  => array(
											'title'=>'財富榜',
											'value'=>'財富',											
										),
										9  => array('title'=>'武器榜','value'=>'戰鬥力'),
										10 => array('title'=>'防具榜','value'=>'戰鬥力'),
										11 => array('title'=>'飾品榜','value'=>'戰鬥力'),
										12 => array('title'=>'寵物榜','value'=>'戰鬥力'),
										13 => array('title'=>'座騎榜','value'=>'戰鬥力'),
										14 => array('title'=>'將魂榜','value'=>'戰鬥力'),
										15 => array('title'=>'成就榜','value'=>'成就點'),
										18 => array('title'=>'塔防榜','value'=>'波數'),
										17 => array('title'=>'通天塔榜','value'=>'層數'),
										1  => array('title'=>'綜合戰力榜','value'=>'綜合戰力值'),
										2  => array('title'=>'基礎戰力榜','value'=>'基礎戰力值'),
										8  => array('title'=>'上次答題榜','value'=>'答題評分'),
										7  => array('title'=>'攻城戰排行榜','value'=>'攻城戰評分'),									
										4  => array('title'=>'戰場殺人奪旗榜','value'=>'擊殺奪旗數'),
										16 => array('title'=>'戰場每日殺人奪旗榜','value'=>'每日擊殺奪旗數'),
										5  => array('title'=>'低級戰場上一次排行榜','value'=>'擊殺數'),
										6  => array('title'=>'高級戰場上一次排行榜','value'=>'擊殺數'),
									);


//裝備前綴綁定屬性
$equi_prefix_bind_attr = array(
							0=>"默認",
							1=>"無前綴綁定",
							10=>"粗糙非綁",
							11=>"粗糙綁定",
							20=>"普通非綁",
							21=>"普通綁定",
							30=>"精良非綁",
							31=>"精良綁定",
							40=>"完美非綁",
							41=>"完美綁定",
);

//中文星期
$week = array(
	'星期日',
	'星期一',
	'星期二',
	'星期三',
    '星期四',
	'星期五',
	'星期六',
);

//消費點列表
$CONSUME = array(
	//消費
	'EquipStrengthen'              => '裝備強化',			
	'EquipDecompose'               => '裝備分解',		
	'EquipFlush'                   => '裝備洗鍊',
	'EquipInlayGemstone'           => '裝備鑲嵌寶石',
	'EquipUnInlayGemstone'	       => '裝備拆除寶石',
	'EquipUpLevel'			       => '裝備升級',
	'EquipUpQuality'			   => '裝備升品質',
	'ItemCompose'			       => '物品合成',
	'HusongTaskRefresh'		       => '護送任務刷新',
	'NpcShopBuy'				   => 'NPC商店購買',
	'SoulInnEmploy'			       => '將魂僱傭',
	'CreateGuild'				   => '創建軍團',
	'MailSend'				       => '發郵件',
	'PublicSaleCharge'			   => '寄賣管理費',
	'PublicSaleBuy'			       => '購買寄賣物品',
	'MentalityTrain'			   => '將心培養',
	'MentalityUpgradeGengu'	       => '境界提升',
	'MountFeed'				       => '座騎培養',
	'MountStrengthen'		       => '座騎強化',
	'MountLift'				       => '座騎進階',
	'MountFlush'				   => '座騎訓化',
	'BattleFieldJoin'			   => '戰場報名',
	'QuestionSift'				   => '答題過濾',
	'PetEvolve'				       => '寵物進化',
	'PetTransfer'				   => '寵物融合',
	'ReAlive'					   => '元寶復活',
	'RefreshBoardTask'		       => '懸賞任務刷新',
	'CommitBoardTask'		       => '懸賞任務元寶完成',
	'CycleTaskComplete'		       => '循環任務元寶完成',
	'HusongDoubleShengwang'        => '護送雙倍聲望',
	'GuildBossFeed'			       => '軍團BOSS培養',
	'GuildSignin'				   => '軍團簽到',
	'TradeOut'				       => '交易出去',
	'MentalitySpeedUp'		       => '將心加速升級',
	'Expedition'				   => '征戰副本',
	'ShopBuy'				       => '商城購買',
	'ChestShopBuy'			       => '祈福',
	'FbDaycount'				   => '副本次數',
	'QuestionItemAutoSelect'	   => '答題自動選擇',
	'PetListExtend'			       => '寵物列表擴展',
	'PetLiftLingxingAutoBuy'	   => '寵物靈性提升',
	'PetLiftWuxingAutoBuy'	       => '寵物悟性提升',
	'PetSkillBookRefresh'		   => '寵物技能刷新',
	'DailyFind'				       => '經驗找回',
	'Challenge'				       => '競技場挑戰',
	'DailyBuyCoinCost'		       => '五谷豐收',
	'KnapsackStorageExtendGridNum' => '背包倉庫擴展',
	//獲取
	'TaskReward'		           => '任務獎勵',
    'DefGift'		               => '固定禮包',
    'RandGift'		               => '隨機禮包',
    'Achieve'		               => '成就獎勵',
    'GetAccountGold'		       => '儲值',
    'Gm'		                   => 'GM命令',
    'MailReceive'		           => '郵件收取',
    'TradeIn'		               => '交易收取',
    'VipBindGold'		           => 'VIP福利',
    'ActiveDegree'		           => '活躍度獎勵',
    'OfficialSalary'		       => '俸祿',
	'DailyOnlineGift'		       => '在線禮包',
	'UseGoldCard'                  => '使用元寶卡',
	'GemstoneBatchCompose'         => '寶石一鍵合成',
	'TaoFaCommit'                  => '討伐任務元寶完成',
	'ExpeditionResetChapter'       => '征戰副本重置',
	'YijianTishengMentality'       => '一鍵提升將心',
	'ExpeditionCleanUpCost'        => '掃蕩',
	'PassTowerGetRewardCost'       => '通天塔元寶領取獎勵',
	'ItemUse:MoneyCard'            => '使用銅錢卡',
);

//功能活躍度統計
$ACTIVITY = array(
	'FbDaycountPersonal'    =>'個人日常副本',
	'TowerDefendPersonal'   =>'個人塔防副本',
	'FbDaycountTeam'        =>'組隊日常副本',
	'FbDaycountPersonal'    =>'個人日常副本',
	'PassTower'             =>'通天塔副本',
	'Expedition'            =>'征戰副本',
	'JingZhouCityWar'       =>'荊州攻城戰',
	'ChallengeField'        =>'競技場',
	'BoardTask'             =>'懸賞任務',
	'HusongTask'            =>'運鏢',
	'StealPig'              =>'偷豬任務',
	'ChestShop'             =>'祈福',
	'HotSpring'             =>'溫泉',
	'Question'              =>'答題',
	'DailyBuyCoin'          =>'五谷豐收',
	'BattleField'           =>'官渡戰場',
);

//功能重置命令
$FUN_RESET = array(
	'1'=>'戰場活動',
	'2'=>'護送雙倍獎勵',
	'3'=>'荊州攻城戰',
	'4'=>'溫泉活動',
	'5'=>'歡樂偷豬活動（偷豬經驗翻倍）',
);

//重置玩家的功能次數
$COUNT_RESET = array(
	'1'=>'偷豬',
	'2'=>'懸賞',
	'3'=>'運鏢',
	'4'=>'答題',
	'5'=>'討伐',
	'6'=>'競技場',
);

//登入類型
$LOGINTYPE = array(
	'OnGlobalUserLogin' => '登入',
	'OnGlobalUserLogout' => '登出',
);

//軍團職位
$POSITION = array(
	'1' => '士卒',
	'2' => '百夫長',
	'3' => '都統',
	'4' => '副團長',
	'5' => '軍團長',
);

//副本次數重置
$FB_RESET = array(
	'0' => '日常副本【單人】',
	'1' => '日常副本【組隊】',
	'2' => '通天塔【單人】',
	'3' => '守衛營地【單人】',
	'4' => '守衛營地【組隊】',
);

//開啟的活動類型
$ACTIVITY_TYPES = array(
	'1025' => '聖誕活動',
	'1026' => '元旦活動',
	'1027' => '冬日暖陽活動',	
	'1028' => '臘八活動',
	'1029' => '春節活動',
	'1030'=>'情人節活動',
	'1031'=>'轉盤活動',
	'1032'=>'版本活動',	
	'1033'=>'版本活動副本',
);

//場景ID及對應名稱
$SCENE = array(
	1000 => '監獄',
	10010=>	'桃園',
	10011=>	'徐州',
	10012=>	'汜水關',
	10013=>	'洛陽',
	10014=>	'長安',
	10015=>	'平原',
	10016=>	'北平',
	10017=>	'涼州',
	10018=>	'玉門關',
	10019=>	'南郡',
	10020=>	'南蠻',
	10021=>	'交州',
	10022=>	'荊州',
	11010=>	'周倉',
	11020=>	'波才',
	11030=>	'張曼成',
	11040=>	'裴元紹',
	11050=>	'韓忠',
	11060=>	'張寶',
	11070=>	'張梁',
	11080=>	'張角',
	11090=>	'軍團營地',
	13010=>	'單人副本測試',
	13510=>	'組隊副本測試',
	14020=>	'官渡之戰',
	15010=>	'塔第一層',
	15020=>	'塔獎勵層',
	15030=>	'塔最後層',
	13020=>	'塔防單人副本',
	13030=>	'40單人副本',
	13031=>	'50單人副本',	
	13032=>	'60單人副本',
	13033=>	'70單人副本',
	13034=>	'80單人副本',
	13035=>	'90單人副本',
	13036=>	'100單人副本',
	13037=>	'30單人副本',
	14010=>	'個人競技場',
	13530=>	'50組隊副本',
	13531=>	'60組隊副本',
	13532=>	'70組隊副本',
	13533=>	'80組隊副本',
	13534=>	'90組隊副本',
	13535=>	'100組隊副本',
	13536=> '40組隊副本',
	13100=>	'塔防組隊副本',
	11095=>	'李儒',
	11100=>	'宋憲',
	11110=>	'華雄',
	11120=>	'徐榮',
	11130=>	'臧霸',
	11140=>	'陳宮',
	11150=>	'呂布',
	11160=>	'王方',
	11170=>	'董承',
	11180=>	'張濟',
	11190=>	'胡軫',
	11200=>	'李傕',
	11210=>	'郭汜',
	11220=>	'樊稠',
	11230=>	'李蒙',
	11240=>	'呂布',
	11250=>	'董卓',
	16010=>	'溫泉白天',
	16020=>	'溫泉夜晚',
	15011=>	'凡人第一層',
	15012=>	'凡人第二層',
	15013=>	'凡人第三層',
	15014=>	'凡人第四層',
	15015=>	'凡人第五層',
	15016=>	'凡人第六層',
	15017=>	'凡人第七層',
	15018=>	'凡人第八層',
	15019=>	'凡人第九層',
	15020=>	'凡人第十層',
	15021=>	'凡人十一層',
	15022=>	'凡人十二層',
	15023=>	'凡人十三層',
	15024=>	'凡人十四層',
	15025=>	'凡人十五層',
	15026=>	'凡人十六層',
	15027=>	'凡人十七層',
	15028=>	'凡人十八層',
	15029=>	'武聖第一層',
	15030=>	'武聖第二層',
	15031=>	'武聖第三層',
	15032=>	'武聖第四層',
	15033=>	'武聖第五層',
	15034=>	'武聖第六層',
	15035=>	'武聖第七層',
	15036=>	'武聖第八層',
	15037=>	'武聖第九層',
	15038=>	'武聖第十層',
	15039=>	'武聖十一層',
	15040=>	'武聖十二層',
	15041=>	'武聖十三層',
	15042=>	'武聖十四層',
	15043=>	'武聖十五層',
	15044=>	'武聖十六層',
	15045=>	'武聖十七層',
	15046=>	'武聖十八層',
);

$BOSS = array(
            30390=>'張梁',
			30391=>'張寶',
			30392=>'張角',
			30590=>'華雄',
			30591=>'陳宮',
			30592=>'徐榮',
			31490=>'貂蟬',
		    31491=>'呂布',
			31492=>'董卓',
			30690=>'文聘',
			30691=>'刑道榮',
			30692=>'劉表',
			30790=>'顏良',
			30791=>'文丑',
			30792=>'審配',
			30793=>'田豐',
			30794=>'甄姬',
			30795=>'袁紹',
);

//背包
$KNAPSACK = array(
	'CertainPut'                 => '物品獲取',
	'Use'                        => '物品使用',
	'Discard'                    => '物品丟棄',
	'DiscardEquipment'           => '裝備丟棄',
	'ConsumeItem'                => '物品消耗',
	'ConsumeEquipment'           => '裝備消耗',
	'ConsumeItemByIndex'         => '物品消耗',
	'ConsumeEquipmentByIndex'    => '裝備消耗',
	'ConsumeItemByIndexList'     => '物品批量消耗',
	'ConsumeEquipmentByIndexList'=> '裝備批量消耗',
);

//爬塔階段
$STAGE = array(
	0=>'凡人',
	1=>'武聖',
);

//戰場日誌
$BATTLE = array(
	'Join'   => '戰場報名',
	'Enter'  => '進入戰場',
	'Reward' => '戰場獎勵',
);

//寵物技能
$PETSKILL = array(
					1=>'一階氣血',
					2=>'二階氣血',
					3=>'三階氣血',
					4=>'四階氣血',
					5=>'五階氣血',
					6=>'一階法力',
					7=>'二階法力',
					8=>'三階法力',
					9=>'四階法力',
					10=>'五階法力',
					11=>'一階攻擊',
					12=>'二階攻擊',
					13=>'三階攻擊',
					14=>'四階攻擊',
					15=>'五階攻擊',
					16=>'一階防禦',
					17=>'二階防禦',
					18=>'三階防禦',
					19=>'四階防禦',
					20=>'五階防禦',
					21=>'一階命中',
					22=>'二階命中',
					23=>'三階命中',
					24=>'四階命中',
					25=>'五階命中',
					26=>'一階閃避',
					27=>'二階閃避',
					28=>'三階閃避',
					29=>'四階閃避',
					30=>'五階閃避',
					31=>'一階破擊',
					32=>'二階破擊',
					33=>'三階破擊',
					34=>'四階破擊',
					35=>'五階破擊',
					36=>'一階抵擋',
					37=>'二階抵擋',
					38=>'三階抵擋',
					39=>'四階抵擋',
					40=>'五階抵擋',
					41=>'一階暴擊',
					42=>'二階暴擊',
					43=>'三階暴擊',
					44=>'四階暴擊',
					45=>'五階暴擊',
					46=>'一階堅韌',
					47=>'二階堅韌',
					48=>'三階堅韌',
					49=>'四階堅韌',
					50=>'五階堅韌',
					51=>'一階必殺',
					52=>'二階必殺',
					53=>'三階必殺',
					54=>'四階必殺',
					55=>'五階必殺',
);

//拍賣操作類型
$PUBLICTYPE = array(
	'add'   =>'上架',
	'buy'   =>'購買',
	'overtime_remove'=>'超時下架',
	'user_remove'=>'主動下架',
);
//軍團事件
$GUILDEVENT = array(
	'1'=>'創建軍團',
	'2'=>'成員入團',
	'3'=>'退出軍團',
	'4'=>'踢出軍團',
	'5'=>'成員任命',
	'6'=>'卸任',
	'7'=>'轉讓軍團長',
	'8'=>'彈劾軍團長',
	'9'=>'軍團升級',
	'11'=>'更改許可權設置',
	'12'=>'召喚神獸',
	'13'=>'聯盟操作',
	'16'=>'軍團降級',
);

?>